#!/bin/bash

###############################################################################
# Author       : Emrah Uludag
# GitHub       : https://github.com/emrahuludag/govc-deploy-automation.git
# Description  : Automated VM deployment using govc (vSphere CLI)
# Created Date : 2025-02-14
###############################################################################

set -euo pipefail

RED='\033[1;31m'
GREEN='\033[0;32m'
YELLOW='\033[1;33m'
BLUE='\033[1;34m'
CYAN='\033[1;36m'
NC='\033[0m'

echo "=============================================================================================================="
echo -e " ${GREEN}░▀█▀░█▀█░█▀▀░█▀▄░█▀█░░░█▀▀░█░░░█▀█░█░█░█▀▄░░░█▀█░█░░░█▀█░▀█▀░█▀▀░█▀█░█▀▄░█▄█░█▀▀░░░▀█▀░█▀▀░█▀█░█▄█"
echo -e " ${GREEN}░░█░░█░█░█▀▀░█▀▄░█▀█░░░█░░░█░░░█░█░█░█░█░█░░░█▀▀░█░░░█▀█░░█░░█▀▀░█░█░█▀▄░█░█░▀▀█░░░░█░░█▀▀░█▀█░█░█"
echo -e " ${GREEN}░▀▀▀░▀░▀░▀░░░▀░▀░▀░▀░░░▀▀▀░▀▀▀░▀▀▀░▀▀▀░▀▀░░░░▀░░░▀▀▀░▀░▀░░▀░░▀░░░▀▀▀░▀░▀░▀░▀░▀▀▀░░░░▀░░▀▀▀░▀░▀░▀░▀"
echo "=============================================================================================================="
echo -e "${RED}=============================================================================================================="
echo -e "${GREEN}                                   GOVC vSphere Automation"
echo -e "${BLUE}                             VMware | Linux & Microsoft Provisioning"
echo -e "${RED}==============================================================================================================${NC}"
sleep 2

echo '[1].Deploy Linux'
echo '[2].Deploy Windows'
echo '[3].Install govc on Linux'
echo "--------------------------------------------------------------------------------------------------------------"

echo '[q].Quit'
printf 'Please Select Tool for RUN: '
read DISTR

case $DISTR in
     1)
          echo "░ Deploy Linux from ./vms/linuxvms.csv"
		  echo "Deployment will start in 5 seconds. Press Ctrl+C to cancel..."
          sleep 5
          bash ./bin/deploy_linux.sh
          ;;        
     2)
          echo "░ Deploy Windows from ./vms/windowsvms.csv"
		  echo "Deployment will start in 5 seconds. Press Ctrl+C to cancel..."
          sleep 5
          bash ./bin/deploy_windows.sh
          ;;
     3)
          echo "=========================================="
	  echo "govc installation..."
     	  echo "=========================================="

	  if ! command -v govc >/dev/null 2>&1; then
	    echo "govc not found. Installing govc..."
	    curl -L -o /tmp/govc.tar.gz \
	       https://github.com/vmware/govmomi/releases/latest/download/govc_Linux_x86_64.tar.gz

	    tar -xzf /tmp/govc.tar.gz -C /tmp
	    mv /tmp/govc /usr/local/bin/
	    chmod +x /usr/local/bin/govc

	    echo "govc installed successfully."
	  else
	    echo "govc already installed."
	  fi
          ;;
     q)
          echo "░ No tool selected script will exit"
          ;;
esac
echo "░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░"

